# Bar Terminations Data Hook Type Id At Start Property

Source: https://www.revitapidocs.com/2026/4b5feef0-7973-b5e3-c897-28a5de8fa723.htm

---

| Bar Terminations Data Hook Type Id At Start Property |
| --- |

Identifies the hook type at the start of bar.
 Setting this property to a valid value, will set the CrankTypeIdAtStart and EndTreatmentTypeIdAtStart to ElementId.InvalidElementId
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ElementId HookTypeIdAtStart { get; set; }
```

```
Public Property HookTypeIdAtStart As ElementId
	Get
	Set
```

```
public:
property ElementId^ HookTypeIdAtStart {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

```
member HookTypeIdAtStart : ElementId with get, set
```

#### Property Value

ElementId Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: hookTypeIdAtStart doesn't represent a hook type. |
| ArgumentNullException | When setting this property: A non\-optional argument was null |

See Also

#### Reference

BarTerminationsData Class Autodesk.Revit.DB.Structure Namespace